Autodesk.Revit.DB.FormatOptions.GetName
Gets the string used in type catalogs to identify the display unit in this FormatOptions.
Remarks:
This method is equivalent to calling
UnitUtils.GetTypeCatalogString(DisplayUnitType)
with the display unit in this FormatOptions.
Returns:
The type catalog string, or an empty string if the display unit cannot be used in type catalogs.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.HasRounding
Checks whether the display unit in this FormatOptions has an accuracy value.
Remarks:
All display units now have accuracy values, so this method always
returns true when UseDefault is false.
Returns:
True if the display unit has an accuracy value.  Returns true for all display units.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.GetRounding
Gets the accuracy to which values will be rounded.
Remarks:
This method returns the value of the
Accuracy property.  See that property
for details.
Returns:
The accuracy.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.UseGrouping
Indicates if digit grouping symbols should be displayed.
Remarks:
This property is equivalent to the
UseDigitGrouping property.  See
that property for details.
True if digit grouping symbols should be displayed, false otherwise.  The default is false.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.#ctor(Autodesk.Revit.DB.UnitSymbolType,Autodesk.Revit.DB.DisplayUnitType)
Creates a new FormatOptions object that represents custom formatting.
Remarks:
This constructor is equivalent to
FormatOptions(DisplayUnitType, UnitSymbolType).
unitSymbol:
The unit symbol.
displayUnit:
The display unit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
displayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
-or-
unitSymbol is not a valid unit symbol for displayUnit.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014